import random

abc=0
fff=0
aaa=0
lll=0

x=[["#","#","#","#","#","#","#","#","#","#","#","#","#","#"],
   ["#","0"," ",' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#'],
   ["#",' ','#','#','#',' ','#','#','#','#','#','#',' ','#'],
   ["#",' ','#',' ',' ',' ','#','#','#',' ',' ',' ',' ','#'],
   ["#",' ','#',' ','s',' ','#','#','#',' ','s',' ','#','#'],
   ["#",'№','#',' ',' ',' ','#','#','#',' ',' ',' ','#','#'],
   ["#",' ','#',' ','#','#','#','#','#',' ','#','#','#','#'],
   ["#",'%','#',' ','#','#','#','#','#',' ','#','#','#','#'],
   ["#",' ','#','1','#','#','#','#','#','2','%','№','№','?'],
   ["#",' ','#','#','#','#','#','#','#','#','#','#','#','#'],
   ["#",' ','#','#','#','#','#','#','#','#','#','#','#','#'],
   ["_",' ','#','#','#','#','#','#','#','#','#','#','#','#'],
   ["#",' ','#','#','#','#','#','#','#','#','#','#','#','#'],
   ["#",'w','#','#','#','#','#','#','#','#','#','#','#','#'],
   ["#",'#','#','#','#','#','#','#','#','#','#','#','#','#']]

for a in x:
    for b in a:
        print(b,end=' ')
    print()
print("0-игрок,#-стена,s-страж,1-слабый ломатель стен,2-ломатель стен,№-слабая хрупкая стена,%-хрупкая стена,w-финиш") 

c=1
d=1

while c!=13:
    i=input("Введите куда вы хотите переместится(игра на английской раскладке!)(w-вверх,s-вниз,a-влево,d-вправо)")
    
    if i=="w":
        if x[c-1][d]!='#':
            if c!=1:
                x[c][d]=' '
                c-=1
                x[c][d]='0'
            else:
                print("BONK")
                
    if i=="s":
        if x[c+1][d]!='#':
            if c!=14:
                x[c][d]=' '
                c+=1
                x[c][d]='0'
            else:
                print("BONK")
                
    if i=="a":
        if x[c][d-1]!='#':
            if d!=1:
                x[c][d]=' '
                d-=1
                x[c][d]='0'
            else:
                print("BONK")
                
    if i=="d":
        if x[c][d+1]!='#':        
            if d!=14:
                x[c][d]=' '
                d+=1
                x[c][d]='0'
            else:
                print("BONK")
                
    if c==3 and d==5:            
        y=random.randint(1,3)
        print("Страж 1:Реши пример прежде чем пройдёшь!")
        if y==1:
            h=input("99*17=?")
            while h!="1683":
                print("неправильно")
                aaa=1
                h=int(input("99*17=?"))
            print("правильно")
        if y==2:
            while True:
                g=input("x^2+x-6=0 x=?")
                if g=="2" or g=="-3":
                    break
                print("неправильно")
                aaa=1
            print("правильно")
        if y==3:
            l=input("1/3+3/7=?")
            while l!="16/21":
                print("неправильно")
                aaa=1
                l=int(input("1/3+3/7=?"))
            print("правильно")
            
    if c==3 and d==11:            
        k=random.randint(1,3)
        print("Страж 2:Реши пример прежде чем пройдёшь!")
        if k==1:
            j=input("99*17=?")
            while j!="1683":
                print("неправильно")
                aaa=1
                j=int(input("99*17=?"))
            print("правильно")
        if k==2:
            while True:
                u=input("x^2+x-6=0 x=?")
                if u=="2" or u=="-3":
                    break
                print("неправильно")
                aaa=1
            print("правильно")
        if k==3:
            p=input("1/3+3/7=?")
            while p!="16/21":
                print("неправильно")
                aaa=1
                p=int(input("1/3+3/7=?"))
            print("правильно")
    
    if c==8 and d==3:
        lll=1
    if c==8 and d==9:
        lll=2
    if lll==1:
        x[5][1]=" "
        x[12][8]=" "
        x[13][8]=" "
    if lll==2:
        x[5][1]=" "
        x[12][8]=" "
        x[13][8]=" "
        x[7][1]=" "
        x[11][8]=" "
   
    if x[c]==8 and x[d]==13:
       q=input("Золото или код?:")
       if q=="золото":
           print("Вы получили золотую монетку")
       else:
           ooo=random.randint(1000,9999)
           print(ooo)
           
    if c==11 and i=="a":
        abc=input("Введите код:")
        if abc==ooo:
            fff=1
        
    for a in x:
        for b in a:
            print(b,end=' ')
        print()

rrr=0
if c==13:
    print("Вы получили медаль (за прохождение)")
    rrr+=1
if aaa==0:
    print("Вы получили медаль (ни царапины)")
    rrr+=1    
if fff==1:
    print("Вы получили медаль (???)")
    rrr+=1
if rrr==1:
    print("Вы прошли игру с 1 медалью")
if rrr==2:
    print("Вы прошли игру с 2 медальями")    
if rrr==3:
    print("Вы прошли игру с 3 медальями(ПОЗДРАВЛЯЮ!)")







